в 51 уроке создаем кастомный хук useInitialEffect для того чтобы в нем инкапсулировать проверку на переменную __Project__
я пока этого не делал, и пропускаю это

в 52 уроке, заметил, что нужно пофиксить classnames в пропсах
нужно поправить расположение курсора в инпуте

в 53 урове canEdit можно получать из реселект или кастомный хук

переименовать папку ArticlePage

в 56 уроке нужно написать тесты на fetchNextArticlePage и убедиться что приложение не падает из-за useInfiniteScroll

58 урок сделать onChangeArticleType с дженериком(без приведения типов)
58 урок сделать onChangeArticleType с дженериком(без приведения типов)
